In [57]:
import pandas as pd

In [58]:
titanic = pd.read_csv("Titanic Dataset.csv")

### 1. Select all rows where the 'Sex' column is equal to 'female':

In [60]:
titanic[titanic['Sex'] == 'female']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
6,898,1,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
8,900,1,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
12,904,1,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
...,...,...,...,...,...,...,...,...,...,...,...,...
409,1301,1,3,"Peacock, Miss. Treasteall",female,3.0,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S
410,1302,1,3,"Naughton, Miss. Hannah",female,NaN,0,0,365237,7.7500,NaN,Q
411,1303,1,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0,1,0,19928,90.0000,C78,Q
412,1304,1,3,"Henriksson, Miss. Jenny Lovisa",female,28.0,0,0,347086,7.7750,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C

### 2. Extract the 'Name' and 'Age' columns of passengers from index 10 to 20 using slicing:

In [59]:
titanic.loc[10:20, ['Name', 'Age']]

                                                 Name   Age
10                                   Ilieff, Mr. Ylio   NaN
11                         Jones, Mr. Charles Cresson  46.0
12      Snyder, Mrs. John Pillsbury (Nelle Stevenson)  23.0
13                               Howard, Mr. Benjamin  63.0
14  Chaffee, Mrs. Herbert Fuller (Carrie Constance...  47.0
15      del Carlo, Mrs. Sebastiano (Argenia Genovesi)  24.0
16                                  Keane, Mr. Daniel  35.0
17                                  Assaf, Mr. Gerios  21.0
18                       Ilmakangas, Miss. Ida Livija  27.0
19              Assaf Khalil, Mrs. Mariana (Miriam")"  45.0
20                             Rothschild, Mr. Martin  55.0

### 3. Retrieve rows where passengers embarked from 'C' and only display their 'Fare' and 'Pclass':

In [30]:
titanic[titanic['Embarked'] == 'C'][['Fare', 'Pclass']]

         Fare  Pclass
8      7.2292       3
15    27.7208       2
17     7.2250       3
19     7.2250       3
20    59.4000       1
..        ...     ...
404   27.7208       1
405   13.8625       2
407  211.5000       1
414  108.9000       1
417   22.3583       3

[102 rows x 2 columns]

### 4. Get rows for the first 5 passengers who paid a fare of more than 50 and sort the result by 'Age':

In [31]:
titanic[titanic['Fare'] > 50].sort_values('Age').head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Fare_Rank,Above_Avg_Age
196,1088,0,1,"Spedden, Master. Robert Douglas",male,6.0,0,2,16966,134.500,C,28.0,False
64,956,0,1,"Ryerson, Master. John Borie",male,13.0,2,2,PC 17608,262.375,C,6.0,False
230,1122,0,2,"Sweet, Mr. George Frederick",male,14.0,0,0,220845,65.000,S,57.0,False
360,1252,0,3,"Sage, Master. William Henry",male,14.5,8,2,CA. 2343,69.550,S,53.5,False
212,1104,0,2,"Deacon, Mr. Percy William",male,17.0,0,0,S.O.C. 14879,73.500,S,49.5,False

### 5. Select all columns except the last two, using slicing:

In [32]:
titanic.iloc[:, :-2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,C

### 6. Find rows where passengers’ age is either below 18 or above 60, and display their 'Name' and 'Survived' status:

In [33]:
titanic[(titanic['Age'] < 18) | (titanic['Age'] > 60)][['Name', 'Survived']]

                                                  Name  Survived
2                            Myles, Mr. Thomas Francis         0
5                           Svensson, Mr. Johan Cervin         0
13                                Howard, Mr. Benjamin         0
21                           Olsen, Master. Artur Karl         0
55                                Rice, Master. Albert         0
60                                     Dika, Mr. Mirko         0
64                         Ryerson, Master. John Borie         0
80                                Boulos, Master. Akar         0
81                                  Straus, Mr. Isidor         0
89                         Wells, Master. Ralph Lester         0
96   Cavendish, Mrs. Tyrell William (Julia Florence...         1
104          Thomas, Mrs. Alexander (Thamine Thelma")"         1
114             Straus, Mrs. Isidor (Rosalie Ida Blun)         1
117                    Sandstrom, Miss. Beatrice Irene         1
120                               Watt, Miss. Bertha J         1
125                           Cribb, Miss. Laura Alice         1
140                        Goodwin, Miss. Jessie Allis         1
142                         Ryerson, Mr. Arthur Larned         0
152                                 Storey, Mr. Thomas         0
154                       Asplund, Master. Filip Oscar         0
161                     Touma, Master. Georges Youssef         0
175                          Brown, Miss. Edith Eileen         1
179  Compton, Mrs. Alexander Taylor (Mary Eliza Ing...         1
187                                 Davies, Mr. Joseph         0
192                  van Billiard, Master. Walter John         0
193                                  Lingane, Mr. John         0
194                      Drew, Master. Marshall Brines         0
196                    Spedden, Master. Robert Douglas         0
201            Danbom, Master. Gilbert Sigvard Emanuel         0
203                         Quick, Miss. Winifred Vera         1
212                          Deacon, Mr. Percy William         0
230                        Sweet, Mr. George Frederick         0
236                           Warren, Mr. Frank Manley         0
250                              West, Miss. Barbara J         1
263                       Klasen, Miss. Gertrud Emilia         1
269                                  Pokrnic, Mr. Mate         0
281                     Peacock, Master. Alfred Edward         0
283                         Touma, Miss. Maria Youssef         1
284                        Rosblom, Miss. Salli Helena         1
296                              Laroche, Miss. Louise         1
305  Crosby, Mrs. Edward Gifford (Catherine Elizabe...         1
307                          Aks, Master. Philip Frank         0
315                               Hagardon, Miss. Kate         1
326                       Becker, Miss. Ruth Elizabeth         1
345                        Abelseth, Miss. Karen Marie         1
354            Dean, Miss. Elizabeth Gladys Millvina""         1
360                        Sage, Master. William Henry         0
379                        Asplund, Master. Carl Edgar         0
389                        Palsson, Master. Paul Folke         0
392                      Abbott, Master. Eugene Joseph         0
403                             Carrau, Mr. Jose Pedro         0
409                          Peacock, Miss. Treasteall         1

### 7. Filter passengers who not survived (0) and are males. Sort the result by 'Fare' in descending order:

In [61]:
titanic[(titanic['Survived'] == 0) & (titanic['Sex'] == 'male')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
7,899,0,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
407,1299,0,1,"Widener, Mr. George Dunton",male,50.0,1,1,113503,211.5000,C80,C
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

### 8. Retrieve passengers whose 'Fare' is greater than 100 and 'Age' is not null:

In [62]:
titanic[(titanic['Fare'] > 100) & (titanic['Age'].notnull())]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
24,916,1,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.0,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
53,945,1,1,"Fortune, Miss. Ethel Flora",female,28.0,3,2,19950,263.0000,C23 C25 C27,S
59,951,1,1,"Chaudanson, Miss. Victorine",female,36.0,0,0,PC 17608,262.3750,B61,C
64,956,0,1,"Ryerson, Master. John Borie",male,13.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
69,961,1,1,"Fortune, Mrs. Mark (Mary McDougald)",female,60.0,1,4,19950,263.0000,C23 C25 C27,S
74,966,1,1,"Geiger, Miss. Amalie",female,35.0,0,0,113503,211.5000,C130,C
75,967,0,1,"Keeping, Mr. Edwin",male,32.5,0,0,113503,211.5000,C132,C
81,973,0,1,"Straus, Mr. Isidor",male,67.0,1,0,PC 17483,221.7792,C55 C57,S
114,1006,1,1,"Straus, Mrs. Isidor (Rosalie Ida Blun)",female,63.0,1,0,PC 17483,221.7792,C55 C57,S
141,1033,1,1,"Daniels, Miss. Sarah",female,33.0,0,0,113781,151.5500,NaN,S
142,1034,0,1,"Ryerson, Mr. Arthur Larned",male,61.0,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
156,1048,1,1,"Bird, Miss. Ellen",female,29.0,0,0,PC 17483,221.7792,C97,S
184,1076,1,1,"Douglas, Mrs. Frederick Charles (Mary Helene B...",female,27.0,1,1,PC 17558,247.5208,B58 B60,C
196,1088,0,1,"Spedden, Master. Robert Douglas",male,6.0,0,2,16966,134.5000,E34,C
202,1094,0,1,"Astor, Col. John Jacob",male,47.0,1,0,PC 17757,227.5250,C62 C64,C
217,1109,0,1,"Wick, Mr. George Dennick",male,57.0,1,1,36928,164.8667,NaN,S
218,1110,1,1,"Widener, Mrs. George Dunton (Eleanor Elkins)",female,50.0,1,1,113503,211.5000,C80,C
239,1131,1,1,"Douglas, Mrs. Walter Donald (Mahala Dutton)",female,48.0,1,0,PC 17761,106.4250,C86,C
242,1134,0,1,"Spedden, Mr. Frederic Oakley",male,45.0,1,1,16966,134.5000,E34,C
252,1144,0,1,"Clark, Mr. Walter Miller",male,27.0,1,0,13508,136.7792,C89,C
272,1164,1,1,"Clark, Mrs. Walter Miller (Virginia McDowell)",female,26.0,1,0,13508,136.7792,C89,C
306,1198,0,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.5500,C22 C26,S
314,1206,1,1,"White, Mrs. John Stuart (Ella Holmes)",female,55.0,0,0,PC 17760,135.6333,C32,C
316,1208,0,1,"Spencer, Mr. William Augustus",male,57.0,1,0,PC 17569,146.5208,B78,C
324,1216,1,1,"Kreuchen, Miss. Emilie",female,39.0,0,0,24160,211.3375,NaN,S
343,1235,1,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.0,0,1,PC 17755,512.3292,B51 B53 B55,C
371,1263,1,1,"Wilson, Miss. Helen Alice",female,31.0,0,0,16966,134.5000,E39 E41,C
375,1267,1,1,"Bowen, Miss. Grace Scott",female,45.0,0,0,PC 17608,262.3750,NaN,C
400,1292,1,1,"Bonnell, Miss. Caroline",female,30.0,0,0,36928,164.8667,C7,S
407,1299,0,1,"Widener, Mr. George Dunton",male,50.0,1,1,113503,211.5000,C80,C
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C

### 9. Select the first 10 rows of passengers where 'Age' is greater than the median age of all passengers:

In [63]:
median_age = titanic['Age'].median()
titanic[titanic['Age'] > median_age].head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
6,898,1,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
11,903,0,1,"Jones, Mr. Charles Cresson",male,46.0,0,0,694,26.0000,NaN,S
13,905,0,2,"Howard, Mr. Benjamin",male,63.0,1,0,24065,26.0000,NaN,S
14,906,1,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S
16,908,0,2,"Keane, Mr. Daniel",male,35.0,0,0,233734,12.3500,NaN,Q
19,911,1,3,"Assaf Khalil, Mrs. Mariana (Miriam"")""",female,45.0,0,0,2696,7.2250,NaN,C
20,912,0,1,"Rothschild, Mr. Martin",male,55.0,1,0,PC 17603,59.4000,NaN,C

### 10. Find the rows where the 'Cabin' column is null, and extract the 'Name' and 'Ticket' columns for those passengers:

In [64]:
titanic[titanic['Cabin'].isnull()][['Name', 'Ticket']]

                                             Name              Ticket
0                                Kelly, Mr. James              330911
1                Wilkes, Mrs. James (Ellen Needs)              363272
2                       Myles, Mr. Thomas Francis              240276
3                                Wirz, Mr. Albert              315154
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)             3101298
..                                            ...                 ...
412                Henriksson, Miss. Jenny Lovisa              347086
413                            Spector, Mr. Woolf           A.5. 3236
415                  Saether, Mr. Simon Sivertsen  SOTON/O.Q. 3101262
416                           Ware, Mr. Frederick              359309
417                      Peter, Master. Michael J                2668

[327 rows x 2 columns]

### 11. Filter passengers whose 'SibSp' (siblings/spouses aboard) is greater than 1, and 'Age' is less than 30. Show only their 'Name', 'Age', and 'SibSp':

In [65]:
titanic[(titanic['SibSp'] > 1) & (titanic['Age'] < 30)][['Name', 'Age', 'SibSp']]

                              Name   Age  SibSp
9          Davies, Mr. John Samuel  21.0      2
31   Jefferys, Mr. Clifford Thomas  24.0      2
52   Hocking, Miss. Ellen Nellie""  20.0      2
53      Fortune, Miss. Ethel Flora  28.0      3
55            Rice, Master. Albert  10.0      4
64     Ryerson, Master. John Borie  13.0      2
140    Goodwin, Miss. Jessie Allis  10.0      5
154   Asplund, Master. Filip Oscar  13.0      4
167        Ford, Mr. Edward Watson  18.0      2
187             Davies, Mr. Joseph  17.0      2
319   Jefferys, Mr. Ernest Wilfred  22.0      2
326   Becker, Miss. Ruth Elizabeth  12.0      2
360    Sage, Master. William Henry  14.5      8
376              Kink, Miss. Maria  22.0      2
379    Asplund, Master. Carl Edgar   5.0      4
389    Palsson, Master. Paul Folke   6.0      3
394       Kink-Heilmann, Mr. Anton  29.0      3

### 12. Assign ranks to passengers based on their 'Fare', with higher fares getting higher ranks. Allow ties in the ranking:

In [66]:
titanic['Fare_Rank'] = titanic['Fare'].rank(ascending=False)
titanic[['Fare', 'Fare_Rank']].head(10)

      Fare  Fare_Rank
0   7.8292      331.0
1   7.0000      409.5
2   9.6875      263.0
3   8.6625      275.5
4  12.2875      246.0
5   9.2250      269.0
6   7.6292      376.0
7  29.0000      114.0
8   7.2292      393.0
9  24.1500      154.0

### 13. Check if any column in the dataset contains missing values. If yes, display the column names:

In [67]:
missing_columns = titanic.columns[titanic.isnull().any()]
print('Columns with missing values:', missing_columns.tolist())

Columns with missing values: ['Age', 'Fare', 'Cabin', 'Fare_Rank']

### 14. Identify duplicate entries in the dataset based on the 'Name' column and remove them permanently:

In [70]:
titanic[titanic['Name'].duplicated()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked, Fare_Rank]
Index: []

### 15. Extract passengers whose 'Pclass' is either 1 or 3 and store their information in a new DataFrame:

In [72]:
new_df = titanic[titanic['Pclass'].isin([1, 3])]
new_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_Rank
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,331.0
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,409.5
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,275.5
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,246.0
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S,269.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S,290.0
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,30.0
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S,386.0
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S,290.0
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C,163.0

### 16. Calculate the correlation between 'Fare' and 'Age' and display the result:

In [19]:
fare_age_corr = titanic['Fare'].corr(titanic['Age'])
print('Correlation between Fare and Age:', fare_age_corr)

Correlation between Fare and Age: 0.3379315845519922

### 17. Remove the 'Cabin' column from the dataset in such a way that it cannot be recovered:

In [73]:
titanic.drop(columns=['Cabin'], inplace=True)
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Fare_Rank
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q,331.0
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S,409.5
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q,263.0
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S,275.5
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S,246.0

### 18. Replace all missing values in the 'Embarked' column with the value that occurs most frequently in it:

In [21]:
most_frequent_embarked = titanic['Embarked'].mode()[0]
titanic['Embarked'] = titanic['Embarked'].fillna(most_frequent_embarked)
print(titanic['Embarked'].isnull().sum())

0

In [74]:
titanic.sample(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Fare_Rank
354,1246,1,3,"Dean, Miss. Elizabeth Gladys Millvina""""",female,0.17,1,2,C.A. 2315,20.575,S,177.5
19,911,1,3,"Assaf Khalil, Mrs. Mariana (Miriam"")""",female,45.00,0,0,2696,7.225,C,402.0
307,1199,0,3,"Aks, Master. Philip Frank",male,0.83,0,1,392091,9.350,S,267.0

### 19. Create a new column named 'Above_Avg_Age' that stores True if a passenger's age is greater than the dataset's average age, otherwise False:

In [75]:
avg_age = titanic['Age'].mean()
titanic['Above_Avg_Age'] = titanic['Age'] > avg_age
titanic[['Age', 'Above_Avg_Age']].head()

    Age  Above_Avg_Age
0  34.5           True
1  47.0           True
2  62.0           True
3  27.0          False
4  22.0          False

### 20. Identify rows where any column contains NaN values and remove all such rows from the dataset:

In [23]:
titanic_cleaned = titanic.dropna()
print(titanic_cleaned.isnull().sum().sum())

0